backend/app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."room_id" = ? LIMIT ?  [["room_id", 1], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."room_id" = ? LIMIT ?  [["room_id", "1"], ["LIMIT", 1]]
---
  def index
    items = Room.find_by(id: params[:id]).items

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    item = Item.find(params[:id])

INSERT INTO "items" ("take", "closed", "talk", "locked", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["take", 0], ["closed", 0], ["talk", 0], ["locked", 0], ["room_id", 1], ["created_at", "2021-03-14 21:21:40.843835"], ["updated_at", "2021-03-14 21:21:40.843835"]]
---
  def create
    # byebug
    item = Item.new(item_params)
    if item.save

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 4]]
---
  def destroy
    item = Item.find(params[:id])
    item.destroy

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_item
      item = Item.find(params[:id])