backend/app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def index
    if params[:id]
      rooms = Room.find_by(user_id: params[:id])