backend/app/controllers/rooms_controller.rb

  def index
    if params[:id]
      byebug
      user = User.find(params[:id])
      rooms = user.rooms

    else
      byebug
      rooms = Room.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms"

  def show
    room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    room = Room.new(room_params)
    if room.save
---
INSERT INTO "rooms" ("name", "setting", "time_limit", "completed_message", "attempts", "attempts_allowed", "times_completed", "obj_room", "obj_exit", "lock", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    # byebug
    room = Room.find(params[:id])
    if room.update(room_params)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "rooms" SET "time_limit" = ?, "attempts_allowed" = ?, "obj_room" = ?, "obj_exit" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["time_limit", 0], ["attempts_allowed", 0], ["obj_room", 3], ["obj_exit", 0], ["updated_at", "2021-03-17 17:56:55.152329"], ["id", 1]]

  def destroy
    room = Room.find(params[:id])
    room.destroy
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 2]]