backend/app/controllers/sessions_controller.rb

    def login
        user = User.find_by(username: params[:input]) || user = User.find_by(email: params[:input])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "123"], ["LIMIT", 1]]