backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
        user = User.new(user_params)
        #     username: params[:username],
        #     email: params[:email],
        #     password: params[:password],
        #     password_confirmation: params[:password_confirmation]
        # )
        if user.save